# Setting dtypes and saving memory
A colleague of yours is exploring a list of occupations and how they relate to salary. She has given you a list of these occupations, list_of_occupations, and has a few simple questions such as "How many different titles are there?" and "Which position is the most common?".

In [1]:
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
adult= pd.read_csv(r"D:\Cursos\Data_Science_Python\data_sets\adult.csv")
adult.head(3)

,Age,Workclass,fnlgwt,Education,Education Num,Marital Status,Occupation,Relationship,Race,Sex,Capital Gain,Capital Loss,Hours/Week,Country,Above/Below 50k
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K

* Create a `pandas` Series, `series1`, using the `list_of_occupations` (do not set the `dtype`).

In [2]:
list_of_occupations=['Data Scientist' 'Data Analyst' 'Statistician']
series1 = pd.Series(list_of_occupations)
series1

0    Data ScientistData AnalystStatistician
dtype: object

* Print both the data type and number of bytes used of this new Series.

In [3]:
# Print out the data type and number of bytes for series1
print("series1 data type:", series1.dtypes)
print("series1 number of bytes:", series1.nbytes)

series1 data type: object
series1 number of bytes: 8

* Create a second `pandas` Series, `series2`, using the `list_of_occupations` and set the `dtype` to `"category"`.

In [4]:
# Create a Series, "category" dtype
series2 = pd.Series(list_of_occupations, dtype="category")

Print both the data type and number of bytes used of this new Series.

In [5]:
# Print out the data type and number of bytes for series2
print("series2 data type:", series2.dtypes)
print("series2 number of bytes:", series2.nbytes)

series2 data type: category
series2 number of bytes: 9